app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "created_at", "updated_at") VALUES (?, ?, ?)  [["first_name", "Lindsey"], ["created_at", "2019-03-19 10:06:24.527937"], ["updated_at", "2019-03-19 10:06:24.527937"]]
---
  def create
    @student = Student.new(student_params)
    @student.save